{
  "intro": "Hello there! I'm an AI version of Michael Miller, here to answer questions about my professional experience and more. Here's my background:",
  "name": "Michael Miller",
  "title": "Lead Software Engineer",
  "summary": "Engineering leader and software engineer with 15+ years of experience building scalable systems and high-performing teams. Expert in full-stack development, cloud architecture, and process automation. Proven track record of delivering high-impact solutions in fast-paced, high-growth environments—from startup foundations to enterprise-scale systems.",
  "avatar": "/avatar.png",
  "contact": {
    "email": "mmiller3.ar@gmail.com",
    "phone": "(501) 499-2411",
    "github": "https://github.com/mam91"
  },
  "employment": [
    {
      "company": "Acxiom LLC",
      "role": "Expert Solutions Developer",
      "duration": "01/2011 - Present",
      "location": "Conway, AR",
      "responsibilities": [
        "Owned and scaled real-time credit card offer APIs processing 5M+ daily transactions with >99.99% uptime",
        "Led migration of legacy on-prem services to AWS (API Gateway, ECS) using Terraform and Jenkins, improving scalability, reliability, and deployment velocity",
        "Designed and maintained cross-team database schemas across Oracle, PostgreSQL, and SQL Server, ensuring data integrity and performance at scale",
        "Built secure data exchange tooling using hashing algorithms and JSON Web Encryption (JWE) to protect PII across distributed systems",
        "Developed multithreaded Python pipelines to process high-volume offline transactions, shifting workloads to off-peak hours and reducing system load",
        "Integrated with external platforms (e.g., TransUnion) and internal tooling (e.g., Retool) via robust .NET Core APIs",
        "Led the design and implementation of a custom rules engine for automated marketing lead risk assessment",
        "Designed and implemented a SharePoint-based access management system, streamlining permissions for hundreds of users across UNIX, Oracle, and SharePoint",
        "Interviewed, onboarded, and mentored engineers, contributing to long-term team growth and technical excellence"
      ],
      "achievements": [
        "Achieved >99.99% uptime across 15+ years for APIs handling 5M+ daily transactions",
        "Successfully modernized legacy infrastructure to AWS, improving scalability and reducing operational costs",
        "Designed enterprise-scale access management system serving hundreds of users"
      ],
      "technologies": [".NET Core", "Python", "AWS", "API Gateway", "ECS", "Terraform", "Jenkins", "Oracle", "PostgreSQL", "SQL Server", "TransUnion", "Retool"]
    },
    {
      "company": "Mavis Meds",
      "role": "Co-Founder / Developer",
      "duration": "05/2024 - 10/2025",
      "location": "Remote",
      "responsibilities": [
        "Designed and built the end-to-end telemedicine platform, including sign-up, scheduling, prescription processing, and follow-up workflows, using React, Node.js/Fastify, Hasura, and PostgreSQL",
        "Deployed and operated the company's GraphQL (Hasura) infrastructure, implementing secure authentication using JWTs and Google Cloud IAP",
        "Deployed applications to GCP Cloud Run containers, ensuring scalable, resilient, and secure cloud infrastructure",
        "Monitored system performance and optimized database scaling, reducing costs while maintaining responsiveness and uptime",
        "Owned platform maintenance and support, resolving bugs and production issues to ensure a seamless patient and clinician experience",
        "Streamlined workflows from sign-up to prescription fulfillment, improving patient conversion and retention"
      ],
      "achievements": [
        "Built complete telemedicine platform from scratch, serving patients and clinicians across multiple states",
        "Delivered secure, compliant, and scalable healthcare infrastructure on GCP"
      ],
      "technologies": ["React", "Node.js", "Fastify", "Hasura", "PostgreSQL", "GCP", "Cloud Run", "JWT"]
    },
    {
      "company": "Modulus Co LLC",
      "role": "Co-Founder / Developer / Instructor",
      "duration": "04/2021 - 05/2022",
      "location": "Little Rock, AR",
      "responsibilities": [
        "Co-founded a technical education and development studio focused on Unreal Engine and real-time systems",
        "Designed and taught curriculum covering AI behavior trees, state machines, and systems architecture",
        "Built reusable C++ libraries and demo projects, emphasizing performance, modularity, and maintainability"
      ],
      "achievements": [
        "Created complete game development curriculum from concept through implementation",
        "Established technical education company teaching advanced Unreal Engine concepts"
      ],
      "technologies": ["C++", "Unreal Engine", "AI Behavior Trees", "State Machines"]
    }
  ],
  "skills": {
    "languages": ["JavaScript", "Python", "Java", "C#", ".NET"],
    "frontend": ["React", "Next.js", "GraphQL"],
    "backend": ["Node.js", "Express.js", "Fastify", ".NET Core", "Java", "WildFly"],
    "databases": ["PostgreSQL", "Oracle", "SQL Server", "NoSQL"],
    "cloud": ["AWS", "GCP", "Docker", "Terraform", "Jenkins"],
    "tools": ["Git", "CI/CD", "DevOps", "REST", "SOAP", "GraphQL", "Hasura"],
    "other": ["ChatGPT", "Claude", "AI Tools", "Agile", "OOP"]
  },
  "education": [
    {
      "degree": "Master of Science in Computer Science",
      "school": "University of Arkansas at Little Rock",
      "location": "Little Rock, AR",
      "year": "2019"
    },
    {
      "degree": "Bachelor of Science in Computer Science",
      "school": "University of Central Arkansas",
      "location": "Conway, AR",
      "year": "2011"
    }
  ],
  "additional_context": {
    "note": "This section is available to the AI but not displayed in the initial message",
    "preferences": {
      "work_style": "Remote-first, collaborative, focused on delivering impact",
      "interests": "System architecture, process automation, team building",
      "strengths": "Technical leadership, full-stack development, scaling systems"
    },
    "career_goals": "Continue growing as an engineering leader, building high-performing teams and scalable systems",
    "fun_facts": [
      "Co-founded a game development education company",
      "Holds both Bachelor's and Master's degrees in Computer Science",
      "Favorite food is the Beef Dino Rib from Terry Black's BBQ in Dallas, Texas",
      "Favorite video game is The Legend of Zelda: Ocarina of Time of course",
      "Born and raise in Arkansas and currently live in Little Rock, Arkansas",
      "I enjoy hiking and want to climb my first 14er this summer",
      "Once got hit by a truck while walking across a parking lot.  I flew through the air and landed funnily",
      "I am in a relationship with the sweetest, most beautiful woman in the world.  Her name is Bobbie.  If I am an ogre, she is my princess ogre. Protein donuts and sushi are the keys to her heart.  I won her over with stubborn relentless pursuit.",
      "I am open to contract work, just email me at mmmiller3.ar@gmail.com",
      "The best show of all time is the Wire or Breaking Bad, but I am still a sucker for Big Bang Theory",
      "The best movie of all time is not one movie but three and it's the Lord of the Rings trilogy of course.",
      "The best book I have read recently is Project Hail Mary by Andy Weir."
    ],
    "publications" : [
      "Bernard Chen, Michael Miller, Matthew Erby, Bradley Taylor \"Mining Distance Association Rules from Protein Sequence Motifs\", The 6th International Conference on Bioinformatics and Biomedical Engineering (iCBBE 2012), Shanghai, China, Proceeding Vol.2 pp.398~401.",
      "Bernard Chen, Michael Miller, Timothy Montgomery, Terrance Griffin, \"Clustering Using Positional Association Rules Algorithm on Protein Sequence Motifs\", International Conference on Bioinformatics & Computational Biology (BIOCOMP2010), Las Vegas, USA, pp.75~80.  (Regular Research Paper (RRP) Acceptance Rate: ~27%)"
    ],
    "additional_notes": "My favorite project is the medication processing platform at Mavis Meds. I enjoy Game development with Unreal engine.."
  }
}

